students = [
    {"фамилия": "Чердаков", "имя": "Владимир","отчество": "Сергеевич", "возраст": 18, "группа": "24ВВВ4"},
    {"фамилия": "Аверьянов", "имя": "Дмитрий", "отчество": "Станиславович","возраст": 19, "группа": "24ВВВ4"},
    {"фамилия": "Евсеев", "имя": "Константин", "отчество": "Бедалагович", "возраст": 19, "группа": "24ЮЮ2"}
]

x = input("Введите фамилию студента для поиска: ")
y = input("Введите имя студента для поиска: ")
found = []
for student in students:
    if student["фамилия"] == x and student["имя"] == y:
        found.append(student)

if found:
    print("\nНайденные студенты:")
    for s in found:
        print(s)
else:
    print("\nСтудент с такими данными не найден.")

